In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4,5])

In [3]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
d1 = pd.DataFrame([
    [1,2,3],
    [100,200,300],
    [10,20,30]]
, columns=['korean', 'japanese', 'chinese'],
index = ['c1', 'c2', 'c3'])

In [5]:
d1

    korean  japanese  chinese
c1       1         2        3
c2     100       200      300
c3      10        20       30

In [6]:
d2 = pd.DataFrame({
    "id" : ['id-1','id-2','id-3','id-4','id-5'],
    "korean" : [10,20,30,40,50],
    "english" : [100,200,300,400,200]
})

In [7]:
d2

     id  korean  english
0  id-1      10      100
1  id-2      20      200
2  id-3      30      300
3  id-4      40      400
4  id-5      50      200

In [8]:
import os
os.makedirs('learn', exist_ok = True)

In [9]:
d2.to_csv("learn/d2.csv")

In [10]:
p1 = pd.read_csv('learn/d2.csv',header= None)

In [11]:
p1

     0     1       2        3
0  NaN    id  korean  english
1  0.0  id-1      10      100
2  1.0  id-2      20      200
3  2.0  id-3      30      300
4  3.0  id-4      40      400
5  4.0  id-5      50      200

In [12]:
p1 = pd.read_csv('learn/d2.csv', sep ="\t")

In [13]:
p1

  ,id,korean,english
0      0,id-1,10,100
1      1,id-2,20,200
2      2,id-3,30,300
3      3,id-4,40,400
4      4,id-5,50,200

In [14]:
import pandas as pd
movie = pd.read_csv("data/movie.csv")

In [15]:
movie.describe()

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,num_voted_users,cast_total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
count,4867.000000,4901.000000,4814.000000,4893.000000,4909.000000,4.054000e+03,4.916000e+03,4916.000000,4903.000000,4895.000000,4.432000e+03,4810.000000,4903.000000,4916.000000,4590.000000,4916.000000
mean,137.988905,107.090798,691.014541,631.276313,6494.488491,4.764451e+07,8.264492e+04,9579.815907,1.377320,267.668846,3.654749e+07,2002.447609,1621.923516,6.437429,2.222349,7348.294142
std,120.239379,25.286015,2832.954125,1625.874802,15106.986884,6.737255e+07,1.383222e+05,18164.316990,2.023826,372.934839,1.002427e+08,12.453977,4011.299523,1.127802,1.402940,19206.016458
min,1.000000,7.000000,0.000000,0.000000,0.000000,1.620000e+02,5.000000e+00,0.000000,0.000000,1.000000,2.180000e+02,1916.000000,0.000000,1.600000,1.180000,0.000000
25%,49.000000,93.000000,7.000000,132.000000,607.000000,5.019656e+06,8.361750e+03,1394.750000,0.000000,64.000000,6.000000e+06,1999.000000,277.000000,5.800000,1.850000,0.000000
50%,108.000000,103.000000,48.000000,366.000000,982.000000,2.504396e+07,3.313250e+04,3049.000000,1.000000,153.000000,1.985000e+07,2005.000000,593.000000,6.600000,2.350000,159.000000
75%,191.000000,118.000000,189.750000,633.000000,11000.000000,6.110841e+07,9.377275e+04,13616.750000,2.000000,320.500000,4.300000e+07,2011.000000,912.000000,7.200000,2.350000,2000.000000
max,813.000000,511.000000,23000.000000,23000.000000,640000.000000,7.605058e+08,1.689764e+06,656730.000000,43.000000,5060.000000,4.200000e+09,2016.000000,137000.000000,9.500000,16.000000,349000.000000

In [16]:
movie

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [17]:
movie

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [18]:
movie.to_csv('save_data/moov.csv', index=False)

In [19]:
movie.to_excel('save_data/moov.xlsx', index=False)

In [20]:
df1 = pd.read_csv('save_data/moov.csv')

In [21]:
df1

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [22]:
df2 = pd.read_excel("save_data/moov.xlsx")

In [23]:
df2

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [24]:
df = pd.read_csv("data/movie.csv")

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4916 entries, 0 to 4915
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      4897 non-null   object
 1   director_name              4814 non-null   object
 2   num_critic_for_reviews     4867 non-null   float64
 3   duration                   4901 non-null   float64
 4   director_facebook_likes    4814 non-null   float64
 5   actor_3_facebook_likes     4893 non-null   float64
 6   actor_2_name               4903 non-null   object
 7   actor_1_facebook_likes     4909 non-null   float64
 8   gross                      4054 non-null   float64
 9   genres                     4916 non-null   object
 10  actor_1_name               4909 non-null   object
 11  movie_title                4916 non-null   object
 12  num_voted_users            4916 non-null   int64
 13  cast_total_facebook_likes  4916 non-null   int64
 14  actor_3_name               4893 non-null   object
 15  facenumber_in_poster       4903 non-null   float64
 16  plot_keywords              4764 non-null   object
 17  movie_imdb_link            4916 non-null   object
 18  num_user_for_reviews       4895 non-null   float64
 19  language                   4902 non-null   object
 20  country                    4911 non-null   object
 21  content_rating             4616 non-null   object
 22  budget                     4432 non-null   float64
 23  title_year                 4810 non-null   float64
 24  actor_2_facebook_likes     4903 non-null   float64
 25  imdb_score                 4916 non-null   float64
 26  aspect_ratio               4590 non-null   float64
 27  movie_facebook_likes       4916 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [26]:
df.isna().sum()

color                         19
director_name                102
num_critic_for_reviews        49
duration                      15
director_facebook_likes      102
actor_3_facebook_likes        23
actor_2_name                  13
actor_1_facebook_likes         7
gross                        862
genres                         0
actor_1_name                   7
movie_title                    0
num_voted_users                0
cast_total_facebook_likes      0
actor_3_name                  23
facenumber_in_poster          13
plot_keywords                152
movie_imdb_link                0
num_user_for_reviews          21
language                      14
country                        5
content_rating               300
budget                       484
title_year                   106
actor_2_facebook_likes        13
imdb_score                     0
aspect_ratio                 326
movie_facebook_likes           0
dtype: int64

In [27]:
df.isna().sum().sum()

2656

In [28]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
num_critic_for_reviews,4867.0,1.379889e+02,1.202394e+02,1.00,49.00,108.00,191.00,8.130000e+02
duration,4901.0,1.070908e+02,2.528602e+01,7.00,93.00,103.00,118.00,5.110000e+02
director_facebook_likes,4814.0,6.910145e+02,2.832954e+03,0.00,7.00,48.00,189.75,2.300000e+04
actor_3_facebook_likes,4893.0,6.312763e+02,1.625875e+03,0.00,132.00,366.00,633.00,2.300000e+04
actor_1_facebook_likes,4909.0,6.494488e+03,1.510699e+04,0.00,607.00,982.00,11000.00,6.400000e+05
gross,4054.0,4.764451e+07,6.737255e+07,162.00,5019656.25,25043962.00,61108412.75,7.605058e+08
num_voted_users,4916.0,8.264492e+04,1.383222e+05,5.00,8361.75,33132.50,93772.75,1.689764e+06
cast_total_facebook_likes,4916.0,9.579816e+03,1.816432e+04,0.00,1394.75,3049.00,13616.75,6.567300e+05
facenumber_in_poster,4903.0,1.377320e+00,2.023826e+00,0.00,0.00,1.00,2.00,4.300000e+01
num_user_for_reviews,4895.0,2.676688e+02,3.729348e+02,1.00,64.00,153.00,320.50,5.060000e+03
budget,4432.0,3.654749e+07,1.002427e+08,218.00,6000000.00,19850000.00,43000000.00,4.200000e+09
title_year,4810.0,2.002448e+03,1.245398e+01,1916.00,1999.00,2005.00,2011.00,2.016000e+03
actor_2_facebook_likes,4903.0,1.621924e+03,4.011300e+03,0.00,277.00,593.00,912.00,1.370000e+05
imdb_score,4916.0,6.437429e+00,1.127802e+00,1.60,5.80,6.60,7.20,9.500000e+00
aspect_ratio,4590.0,2.222349e+00,1.402940e+00,1.18,1.85,2.35,2.35,1.600000e+01
movie_facebook_likes,4916.0,7.348294e+03,1.920602e+04,0.00,0.00,159.00,2000.00,3.490000e+05

In [29]:
df.describe(include=['object'])

,color,director_name,actor_2_name,genres,actor_1_name,movie_title,actor_3_name,plot_keywords,movie_imdb_link,language,country,content_rating
count,4897,4814,4903,4916,4909,4916,4893,4764,4916,4902,4911,4616
unique,2,2397,3030,914,2095,4916,3519,4756,4916,46,65,18
top,Color,Steven Spielberg,Morgan Freeman,Drama,Robert De Niro,Avatar,Steve Coogan,based on novel,http://www.imdb.com/title/tt0499549/?ref_=fn_t...,English,USA,R
freq,4693,26,18,233,48,1,8,4,1,4582,3710,2067

In [32]:
df.describe(include = 'object')

,color,director_name,actor_2_name,genres,actor_1_name,movie_title,actor_3_name,plot_keywords,movie_imdb_link,language,country,content_rating
count,4897,4814,4903,4916,4909,4916,4893,4764,4916,4902,4911,4616
unique,2,2397,3030,914,2095,4916,3519,4756,4916,46,65,18
top,Color,Steven Spielberg,Morgan Freeman,Drama,Robert De Niro,Avatar,Steve Coogan,based on novel,http://www.imdb.com/title/tt0499549/?ref_=fn_t...,English,USA,R
freq,4693,26,18,233,48,1,8,4,1,4582,3710,2067

In [170]:
df.describe(include=['float'])

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio
count,4867.000000,4901.000000,4814.000000,4893.000000,4909.000000,4.054000e+03,4903.000000,4895.000000,4.432000e+03,4810.000000,4903.000000,4916.000000,4590.000000
mean,137.988905,107.090798,691.014541,631.276313,6494.488491,4.764451e+07,1.377320,267.668846,3.654749e+07,2002.447609,1621.923516,6.437429,2.222349
std,120.239379,25.286015,2832.954125,1625.874802,15106.986884,6.737255e+07,2.023826,372.934839,1.002427e+08,12.453977,4011.299523,1.127802,1.402940
min,1.000000,7.000000,0.000000,0.000000,0.000000,1.620000e+02,0.000000,1.000000,2.180000e+02,1916.000000,0.000000,1.600000,1.180000
25%,49.000000,93.000000,7.000000,132.000000,607.000000,5.019656e+06,0.000000,64.000000,6.000000e+06,1999.000000,277.000000,5.800000,1.850000
50%,108.000000,103.000000,48.000000,366.000000,982.000000,2.504396e+07,1.000000,153.000000,1.985000e+07,2005.000000,593.000000,6.600000,2.350000
75%,191.000000,118.000000,189.750000,633.000000,11000.000000,6.110841e+07,2.000000,320.500000,4.300000e+07,2011.000000,912.000000,7.200000,2.350000
max,813.000000,511.000000,23000.000000,23000.000000,640000.000000,7.605058e+08,43.000000,5060.000000,4.200000e+09,2016.000000,137000.000000,9.500000,16.000000

In [173]:
df.columns

Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')

In [33]:
df.columns

Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')

In [95]:
df.index

RangeIndex(start=0, stop=4916, step=1)

In [96]:
grade = pd.read_csv("save_data/grade2.csv")

In [97]:
grade

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [98]:
grade.columns = ['id', '국어', '영어']

In [99]:
grade

     id   국어   영어
0  id-1  100   90
1  id-2   50   80
2  id-3   70  100
3  id-4   60   60
4  id-5   90   40

In [102]:
grade.set_index("국어", inplace= True)

In [103]:
grade

       id   영어
국어
100  id-1   90
50   id-2   80
70   id-3  100
60   id-4   60
90   id-5   40

In [104]:
grade.reset_index()

    국어    id   영어
0  100  id-1   90
1   50  id-2   80
2   70  id-3  100
3   60  id-4   60
4   90  id-5   40

In [111]:
import pandas as pd
grade = pd.read_csv("save_data/grade2.csv", index_col = 0)

In [112]:
grade

      korean  english
id
id-1     100       90
id-2      50       80
id-3      70      100
id-4      60       60
id-5      90       40

In [132]:
grade.columns

Index(['level_0', 'index', 'korean', 'english'], dtype='object')

In [133]:
grade.index

RangeIndex(start=0, stop=5, step=1)

In [134]:
grade.index = list('abcDE')

In [137]:
grade

   level_0 index  korean  english
a        0     a     100       90
b        1     b      50       80
c        2     c      70      100
D        3     D      60       60
E        4     E      90       40

In [139]:
grade.rename(columns= {'index' : '인덱스', 'korean' : '한국', 'english' : '영어'})

   level_0 인덱스   한국   영어
a        0   a  100   90
b        1   b   50   80
c        2   c   70  100
D        3   D   60   60
E        4   E   90   40

In [140]:
grade = pd.read_csv("save_data/grade2.csv")
grade

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [144]:
grade.set_index('id')

      korean  english
id
id-1     100       90
id-2      50       80
id-3      70      100
id-4      60       60
id-5      90       40

In [145]:
grade.reset_index(drop=True)

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [146]:
grade

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [147]:
grade.drop(columns='korean')

     id  english
0  id-1       90
1  id-2       80
2  id-3      100
3  id-4       60
4  id-5       40

In [148]:
grade

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [150]:
grade.drop(columns = 'korean')

     id  english
0  id-1       90
1  id-2       80
2  id-3      100
3  id-4       60
4  id-5       40

In [151]:
grade

     id  korean  english
0  id-1     100       90
1  id-2      50       80
2  id-3      70      100
3  id-4      60       60
4  id-5      90       40

In [152]:
grade.drop(columns=['korean', 'english'])

     id
0  id-1
1  id-2
2  id-3
3  id-4
4  id-5

In [165]:
grade.set_index('id', inplace=True)

In [169]:
grade.drop(index=['id-3','id-1'])

      korean  english
id
id-2      50       80
id-4      60       60
id-5      90       40

In [172]:
grade.index[1:3]

Index(['id-2', 'id-3'], dtype='object', name='id')

In [173]:
grade.drop(labels = grade.index[1:3], axis = 0)

      korean  english
id
id-1     100       90
id-4      60       60
id-5      90       40

In [176]:
grade.drop(index=['id-2', 'id-5'])

      korean  english
id
id-1     100       90
id-3      70      100
id-4      60       60

In [178]:
.grade.drop(labels = grade.index[1:4])

      korean  english
id
id-1     100       90
id-5      90       40

In [180]:
grade

      korean  english
id
id-1     100       90
id-2      50       80
id-3      70      100
id-4      60       60
id-5      90       40

In [181]:
grade.reset_index(drop=True)

   korean  english
0     100       90
1      50       80
2      70      100
3      60       60
4      90       40

In [182]:
grade

      korean  english
id
id-1     100       90
id-2      50       80
id-3      70      100
id-4      60       60
id-5      90       40

In [183]:
grade['chinese'] = 100

In [184]:
grade

      korean  english  chinese
id
id-1     100       90      100
id-2      50       80      100
id-3      70      100      100
id-4      60       60      100
id-5      90       40      100

In [185]:
grade['english'] = 20

In [188]:
grade

      korean  english  chinese
id
id-1     100       20      100
id-2      50       20      100
id-3      70       20      100
id-4      60       20      100
id-5      90       20      100

In [189]:
grade['chinese'] = [100,20,30,50,40]

In [190]:
grade

      korean  english  chinese
id
id-1     100       20      100
id-2      50       20       20
id-3      70       20       30
id-4      60       20       50
id-5      90       20       40

In [191]:
grade['총점'] = grade['korean'] + grade['english'] +grade['chinese']

In [192]:
grade

      korean  english  chinese   총점
id
id-1     100       20      100  220
id-2      50       20       20   90
id-3      70       20       30  120
id-4      60       20       50  130
id-5      90       20       40  150

In [196]:
grade['평균'] = round(grade['총점'] /3 , 2)

In [197]:
grade

      korean  english  chinese   총점     평균
id
id-1     100       20      100  220  73.33
id-2      50       20       20   90  30.00
id-3      70       20       30  120  40.00
id-4      60       20       50  130  43.33
id-5      90       20       40  150  50.00

In [199]:
grade['korean']

id
id-1    100
id-2     50
id-3     70
id-4     60
id-5     90
Name: korean, dtype: int64

In [200]:
r = grade['평균']

In [202]:
r.index

Index(['id-1', 'id-2', 'id-3', 'id-4', 'id-5'], dtype='object', name='id')

In [205]:
grade["korean":'chinese']

Empty DataFrame
Columns: [korean, english, chinese, 총점, 평균]
Index: []

In [206]:
grade[1:4]

      korean  english  chinese   총점     평균
id
id-2      50       20       20   90  30.00
id-3      70       20       30  120  40.00
id-4      60       20       50  130  43.33

In [208]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4916 entries, 0 to 4915
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      4897 non-null   object
 1   director_name              4814 non-null   object
 2   num_critic_for_reviews     4867 non-null   float64
 3   duration                   4901 non-null   float64
 4   director_facebook_likes    4814 non-null   float64
 5   actor_3_facebook_likes     4893 non-null   float64
 6   actor_2_name               4903 non-null   object
 7   actor_1_facebook_likes     4909 non-null   float64
 8   gross                      4054 non-null   float64
 9   genres                     4916 non-null   object
 10  actor_1_name               4909 non-null   object
 11  movie_title                4916 non-null   object
 12  num_voted_users            4916 non-null   int64
 13  cast_total_facebook_likes  4916 non-null   int64
 14  actor_3_name               4893 non-null   object
 15  facenumber_in_poster       4903 non-null   float64
 16  plot_keywords              4764 non-null   object
 17  movie_imdb_link            4916 non-null   object
 18  num_user_for_reviews       4895 non-null   float64
 19  language                   4902 non-null   object
 20  country                    4911 non-null   object
 21  content_rating             4616 non-null   object
 22  budget                     4432 non-null   float64
 23  title_year                 4810 non-null   float64
 24  actor_2_facebook_likes     4903 non-null   float64
 25  imdb_score                 4916 non-null   float64
 26  aspect_ratio               4590 non-null   float64
 27  movie_facebook_likes       4916 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [209]:
movie.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
movie_title                   object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
dtype: object

In [211]:
movie.select_dtypes(include=['float', 'int64'])

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,num_voted_users,cast_total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,723.0,178.0,0.0,855.0,1000.0,760505847.0,886204,4834,0.0,3054.0,237000000.0,2009.0,936.0,7.9,1.78,33000
1,302.0,169.0,563.0,1000.0,40000.0,309404152.0,471220,48350,0.0,1238.0,300000000.0,2007.0,5000.0,7.1,2.35,0
2,602.0,148.0,0.0,161.0,11000.0,200074175.0,275868,11700,1.0,994.0,245000000.0,2015.0,393.0,6.8,2.35,85000
3,813.0,164.0,22000.0,23000.0,27000.0,448130642.0,1144337,106759,0.0,2701.0,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,NaN,131.0,NaN,131.0,NaN,8,143,0.0,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,1.0,87.0,2.0,318.0,637.0,NaN,629,2283,2.0,6.0,NaN,2013.0,470.0,7.7,NaN,84
4912,43.0,43.0,NaN,319.0,841.0,NaN,73839,1753,1.0,359.0,NaN,NaN,593.0,7.5,16.00,32000
4913,13.0,76.0,0.0,0.0,0.0,NaN,38,0,0.0,3.0,1400.0,2013.0,0.0,6.3,NaN,16
4914,14.0,100.0,0.0,489.0,946.0,10443.0,1255,2386,5.0,9.0,NaN,2012.0,719.0,6.3,2.35,660
4915,43.0,90.0,16.0,16.0,86.0,85222.0,4285,163,0.0,84.0,1100.0,2004.0,23.0,6.6,1.85,456

In [213]:
movie.select_dtypes(exclude='object')

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,num_voted_users,cast_total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,723.0,178.0,0.0,855.0,1000.0,760505847.0,886204,4834,0.0,3054.0,237000000.0,2009.0,936.0,7.9,1.78,33000
1,302.0,169.0,563.0,1000.0,40000.0,309404152.0,471220,48350,0.0,1238.0,300000000.0,2007.0,5000.0,7.1,2.35,0
2,602.0,148.0,0.0,161.0,11000.0,200074175.0,275868,11700,1.0,994.0,245000000.0,2015.0,393.0,6.8,2.35,85000
3,813.0,164.0,22000.0,23000.0,27000.0,448130642.0,1144337,106759,0.0,2701.0,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,NaN,131.0,NaN,131.0,NaN,8,143,0.0,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,1.0,87.0,2.0,318.0,637.0,NaN,629,2283,2.0,6.0,NaN,2013.0,470.0,7.7,NaN,84
4912,43.0,43.0,NaN,319.0,841.0,NaN,73839,1753,1.0,359.0,NaN,NaN,593.0,7.5,16.00,32000
4913,13.0,76.0,0.0,0.0,0.0,NaN,38,0,0.0,3.0,1400.0,2013.0,0.0,6.3,NaN,16
4914,14.0,100.0,0.0,489.0,946.0,10443.0,1255,2386,5.0,9.0,NaN,2012.0,719.0,6.3,2.35,660
4915,43.0,90.0,16.0,16.0,86.0,85222.0,4285,163,0.0,84.0,1100.0,2004.0,23.0,6.6,1.85,456

In [221]:
movie.filter(items=['color', 'director'])

      color
0     Color
1     Color
2     Color
3     Color
4       NaN
...     ...
4911  Color
4912  Color
4913  Color
4914  Color
4915  Color

[4916 rows x 1 columns]

In [224]:
movie.filter(regex = r'actor_[123]_name')

          actor_2_name     actor_1_name          actor_3_name
0     Joel David Moore      CCH Pounder             Wes Studi
1        Orlando Bloom      Johnny Depp        Jack Davenport
2         Rory Kinnear  Christoph Waltz      Stephanie Sigman
3       Christian Bale        Tom Hardy  Joseph Gordon-Levitt
4           Rob Walker      Doug Walker                   NaN
...                ...              ...                   ...
4911     Daphne Zuniga      Eric Mabius          Crystal Lowe
4912     Valorie Curry      Natalie Zea         Sam Underwood
4913     Maxwell Moody      Eva Boehnke        David Chandler
4914     Daniel Henney        Alan Ruck           Eliza Coupe
4915  Brian Herzlinger      John August              Jon Gunn

[4916 rows x 3 columns]

In [228]:
grade.loc['id-3']

korean      70.0
english     20.0
chinese     30.0
총점         120.0
평균          40.0
Name: id-3, dtype: float64

In [229]:
grade.loc[['id-1','id-3']]

      korean  english  chinese   총점     평균
id
id-1     100       20      100  220  73.33
id-3      70       20       30  120  40.00

In [231]:
grade[::-1]

      korean  english  chinese   총점     평균
id
id-5      90       20       40  150  50.00
id-4      60       20       50  130  43.33
id-3      70       20       30  120  40.00
id-2      50       20       20   90  30.00
id-1     100       20      100  220  73.33

In [232]:
grade.loc[["id-3"],'총점']

id
id-3    120
Name: 총점, dtype: int64

In [236]:
grade.loc[['id-3','id-5'],['chinese','총점']]

      chinese   총점
id
id-3       30  120
id-5       40  150

In [237]:
grade.loc[["id-1":"id-4"], ['총점','평균']]

SyntaxError: invalid syntax (3726142693.py, line 1)

In [250]:
grade.iloc[0]

korean     100.00
english     20.00
chinese    100.00
총점         220.00
평균          73.33
Name: id-1, dtype: float64

In [248]:
grade.iloc[2:4]

      korean  english  chinese   총점     평균
id
id-3      70       20       30  120  40.00
id-4      60       20       50  130  43.33

In [251]:
grade

      korean  english  chinese   총점     평균
id
id-1     100       20      100  220  73.33
id-2      50       20       20   90  30.00
id-3      70       20       30  120  40.00
id-4      60       20       50  130  43.33
id-5      90       20       40  150  50.00